---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeText
source: html/ecc98088-90d6-fbf3-663e-f203c29ebc92.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeText Property

"Lighting altitude text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyLightingAltitudeText { get; }
```